---
kind: method
id: M:Autodesk.Revit.DB.CurveLoopIterator.Reset
source: html/dd29f071-de4f-4c13-f0d1-10e829b865a0.htm
---
# Autodesk.Revit.DB.CurveLoopIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```